; ModuleID = 'uaf_demo.bc'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.database = type { %struct.link_t, %struct.link_t }
%struct.link_t = type { %struct.link_t*, %struct.link_t* }
%struct.book = type { i8*, i8*, %struct.link_t, %struct.link_t, %struct.author* }
%struct.author = type { i8*, i8*, i8*, %struct.link_t, %struct.link_t, %struct.link_t }
%struct.review = type { %struct.book*, %struct.author*, %struct.link_t, i32 }

@.str = private unnamed_addr constant [8 x i8] c"au_name\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c"bk_name\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"au_publ\00", align 1
@.str.3 = private unnamed_addr constant [8 x i8] c"au_desc\00", align 1
@.str.4 = private unnamed_addr constant [8 x i8] c"bk_desc\00", align 1
@stdin = dso_local global i8* null, align 8, !dbg !0
@.str.5 = private unnamed_addr constant [33 x i8] c"dell->backward != (link_t *)NULL\00", align 1
@.str.1.6 = private unnamed_addr constant [15 x i8] c"../bookshelf.c\00", align 1
@__PRETTY_FUNCTION__.link_unlink = private unnamed_addr constant [27 x i8] c"void link_unlink(link_t *)\00", align 1
@db = dso_local global %struct.database zeroinitializer, align 8, !dbg !10
@.str.2.11 = private unnamed_addr constant [23 x i8] c"auth != (author *)NULL\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "stdin", scope: !2, file: !3, line: 17, type: !9, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !4, globals: !8, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "stubs_demo.c", directory: "/root/2-bookshelf/demo_klee", checksumkind: CSK_MD5, checksum: "469330ce767c1d357e5763f572824a03")
!4 = !{!5, !6}
!5 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!7 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!8 = !{!0}
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!10 = !DIGlobalVariableExpression(var: !11, expr: !DIExpression())
!11 = distinct !DIGlobalVariable(name: "db", scope: !12, file: !13, line: 3, type: !74, isLocal: false, isDefinition: true)
!12 = distinct !DICompileUnit(language: DW_LANG_C99, file: !13, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !14, retainedTypes: !32, globals: !73, splitDebugInlining: false, nameTableKind: None)
!13 = !DIFile(filename: "../bookshelf.c", directory: "/root/2-bookshelf/demo_klee", checksumkind: CSK_MD5, checksum: "1013b1202ab590c65f8b018b1be9cc66")
!14 = !{!15, !22, !28}
!15 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 11, baseType: !17, size: 32, elements: !18)
!16 = !DIFile(filename: "../bookshelf.h", directory: "/root/2-bookshelf/demo_klee", checksumkind: CSK_MD5, checksum: "94234ea2c7b5700b6b528156feaafefd")
!17 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!18 = !{!19, !20, !21}
!19 = !DIEnumerator(name: "CRT_SUCCESS", value: 0)
!20 = !DIEnumerator(name: "CRT_NO_RESOURCES", value: 1)
!21 = !DIEnumerator(name: "CRT_INVALID_PARAM", value: 2)
!22 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 22, baseType: !17, size: 32, elements: !23)
!23 = !{!24, !25, !26, !27}
!24 = !DIEnumerator(name: "EDT_SUCCESS", value: 0)
!25 = !DIEnumerator(name: "EDT_INVALID_PARAM", value: 1)
!26 = !DIEnumerator(name: "EDT_NO_RESOURCES", value: 2)
!27 = !DIEnumerator(name: "EDT_BAD_POINTER", value: 3)
!28 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !16, line: 17, baseType: !17, size: 32, elements: !29)
!29 = !{!30, !31}
!30 = !DIEnumerator(name: "DEL_SUCCESS", value: 0)
!31 = !DIEnumerator(name: "DEL_INVALID_PARAM", value: 1)
!32 = !{!9, !33, !41, !6, !50, !60}
!33 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "link_t", file: !16, line: 32, baseType: !35)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "link_t", file: !16, line: 29, size: 128, elements: !36)
!36 = !{!37, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "backward", scope: !35, file: !16, line: 30, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "link_t", file: !16, line: 7, baseType: !35)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !35, file: !16, line: 31, baseType: !38, size: 64, offset: 64)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "book", file: !16, line: 56, baseType: !43)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "book", file: !16, line: 50, size: 448, elements: !44)
!44 = !{!45, !46, !47, !48, !49}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !43, file: !16, line: 51, baseType: !6, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !43, file: !16, line: 52, baseType: !6, size: 64, offset: 64)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "db_link", scope: !43, file: !16, line: 53, baseType: !34, size: 128, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "au_link", scope: !43, file: !16, line: 54, baseType: !34, size: 128, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "author", scope: !43, file: !16, line: 55, baseType: !50, size: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "author", file: !16, line: 48, baseType: !52)
!52 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "author", file: !16, line: 41, size: 576, elements: !53)
!53 = !{!54, !55, !56, !57, !58, !59}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "publisher", scope: !52, file: !16, line: 42, baseType: !6, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !52, file: !16, line: 43, baseType: !6, size: 64, offset: 64)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !52, file: !16, line: 44, baseType: !6, size: 64, offset: 128)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "db_link", scope: !52, file: !16, line: 45, baseType: !34, size: 128, offset: 192)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "reviews", scope: !52, file: !16, line: 46, baseType: !34, size: 128, offset: 320)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "books", scope: !52, file: !16, line: 47, baseType: !34, size: 128, offset: 448)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "review", file: !16, line: 39, baseType: !62)
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "review", file: !16, line: 34, size: 320, elements: !63)
!63 = !{!64, !67, !70, !71}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "book", scope: !62, file: !16, line: 35, baseType: !65, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !66, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "book", file: !16, line: 9, baseType: !43)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "author", scope: !62, file: !16, line: 36, baseType: !68, size: 64, offset: 64)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "author", file: !16, line: 8, baseType: !52)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "au_link", scope: !62, file: !16, line: 37, baseType: !34, size: 128, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "rating", scope: !62, file: !16, line: 38, baseType: !72, size: 32, offset: 256)
!72 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!73 = !{!10}
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "database", file: !16, line: 61, baseType: !75)
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "database", file: !16, line: 58, size: 256, elements: !76)
!76 = !{!77, !78}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "authors", scope: !75, file: !16, line: 59, baseType: !34, size: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "books", scope: !75, file: !16, line: 60, baseType: !34, size: 128, offset: 128)
!79 = distinct !DICompileUnit(language: DW_LANG_C99, file: !80, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, retainedTypes: !81, splitDebugInlining: false, nameTableKind: None)
!80 = !DIFile(filename: "driver_uaf_demo.c", directory: "/root/2-bookshelf/demo_klee", checksumkind: CSK_MD5, checksum: "f5303e47486bc2b972f29429e4996d72")
!81 = !{!9, !82, !6}
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "book", file: !84, line: 56, baseType: !85)
!84 = !DIFile(filename: "./../bookshelf.h", directory: "/root/2-bookshelf/demo_klee", checksumkind: CSK_MD5, checksum: "94234ea2c7b5700b6b528156feaafefd")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "book", file: !84, line: 50, size: 448, elements: !86)
!86 = !{!87, !88, !89, !97, !98}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !85, file: !84, line: 51, baseType: !6, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !85, file: !84, line: 52, baseType: !6, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "db_link", scope: !85, file: !84, line: 53, baseType: !90, size: 128, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_typedef, name: "link_t", file: !84, line: 32, baseType: !91)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "link_t", file: !84, line: 29, size: 128, elements: !92)
!92 = !{!93, !96}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "backward", scope: !91, file: !84, line: 30, baseType: !94, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "link_t", file: !84, line: 7, baseType: !91)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "forward", scope: !91, file: !84, line: 31, baseType: !94, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "au_link", scope: !85, file: !84, line: 54, baseType: !90, size: 128, offset: 256)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "author", scope: !85, file: !84, line: 55, baseType: !99, size: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "author", file: !84, line: 48, baseType: !101)
!101 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "author", file: !84, line: 41, size: 576, elements: !102)
!102 = !{!103, !104, !105, !106, !107, !108}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "publisher", scope: !101, file: !84, line: 42, baseType: !6, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !101, file: !84, line: 43, baseType: !6, size: 64, offset: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !101, file: !84, line: 44, baseType: !6, size: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "db_link", scope: !101, file: !84, line: 45, baseType: !90, size: 128, offset: 192)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "reviews", scope: !101, file: !84, line: 46, baseType: !90, size: 128, offset: 320)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "books", scope: !101, file: !84, line: 47, baseType: !90, size: 128, offset: 448)
!109 = distinct !DICompileUnit(language: DW_LANG_C99, file: !110, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!110 = !DIFile(filename: "/root/klee/runtime/Freestanding/memcpy.c", directory: "/root/klee/build/runtime/Freestanding", checksumkind: CSK_MD5, checksum: "c636d77d986b2156da8c1ff12af1c5cd")
!111 = distinct !DICompileUnit(language: DW_LANG_C99, file: !112, producer: "Ubuntu clang version 14.0.6", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, splitDebugInlining: false, nameTableKind: None)
!112 = !DIFile(filename: "/root/klee/runtime/Freestanding/memset.c", directory: "/root/klee/build/runtime/Freestanding", checksumkind: CSK_MD5, checksum: "f66ef9ef9131ab198e93a41b1a9ae1fc")
!113 = !{!"Ubuntu clang version 14.0.6"}
!114 = !{i32 7, !"Dwarf Version", i32 5}
!115 = !{i32 2, !"Debug Info Version", i32 3}
!116 = !{i32 1, !"wchar_size", i32 4}
!117 = !{i32 7, !"PIC Level", i32 2}
!118 = !{i32 7, !"PIE Level", i32 2}
!119 = !{i32 7, !"uwtable", i32 1}
!120 = !{i32 7, !"frame-pointer", i32 2}
!121 = distinct !DISubprogram(name: "main", scope: !80, file: !80, line: 90, type: !122, scopeLine: 90, spFlags: DISPFlagDefinition, unit: !79, retainedNodes: !124)
!122 = !DISubroutineType(types: !123)
!123 = !{!72}
!124 = !{}
!125 = !DILocation(line: 91, column: 5, scope: !121)
!126 = !DILocation(line: 92, column: 5, scope: !121)
!127 = !DILocalVariable(name: "au_name", scope: !121, file: !80, line: 93, type: !128)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 1024, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 128)
!131 = !DILocation(line: 93, column: 10, scope: !121)
!132 = !DILocalVariable(name: "bk_name", scope: !121, file: !80, line: 94, type: !128)
!133 = !DILocation(line: 94, column: 10, scope: !121)
!134 = !DILocalVariable(name: "au_publ", scope: !121, file: !80, line: 95, type: !128)
!135 = !DILocation(line: 95, column: 10, scope: !121)
!136 = !DILocalVariable(name: "au_desc", scope: !121, file: !80, line: 96, type: !137)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !7, size: 8192, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 1024)
!140 = !DILocation(line: 96, column: 10, scope: !121)
!141 = !DILocalVariable(name: "bk_desc", scope: !121, file: !80, line: 97, type: !137)
!142 = !DILocation(line: 97, column: 10, scope: !121)
!143 = !DILocation(line: 99, column: 24, scope: !121)
!144 = !DILocation(line: 99, column: 5, scope: !121)
!145 = !DILocation(line: 100, column: 24, scope: !121)
!146 = !DILocation(line: 100, column: 5, scope: !121)
!147 = !DILocation(line: 101, column: 24, scope: !121)
!148 = !DILocation(line: 101, column: 5, scope: !121)
!149 = !DILocation(line: 102, column: 24, scope: !121)
!150 = !DILocation(line: 102, column: 5, scope: !121)
!151 = !DILocation(line: 103, column: 24, scope: !121)
!152 = !DILocation(line: 103, column: 5, scope: !121)
!153 = !DILocation(line: 104, column: 5, scope: !121)
!154 = !DILocation(line: 104, column: 27, scope: !121)
!155 = !DILocation(line: 105, column: 5, scope: !121)
!156 = !DILocation(line: 105, column: 27, scope: !121)
!157 = !DILocation(line: 106, column: 5, scope: !121)
!158 = !DILocation(line: 106, column: 27, scope: !121)
!159 = !DILocation(line: 107, column: 5, scope: !121)
!160 = !DILocation(line: 107, column: 27, scope: !121)
!161 = !DILocation(line: 108, column: 5, scope: !121)
!162 = !DILocation(line: 108, column: 27, scope: !121)
!163 = !DILocation(line: 111, column: 19, scope: !121)
!164 = !DILocation(line: 111, column: 45, scope: !121)
!165 = !DILocation(line: 111, column: 71, scope: !121)
!166 = !DILocation(line: 111, column: 5, scope: !121)
!167 = !DILocation(line: 112, column: 17, scope: !121)
!168 = !DILocation(line: 112, column: 26, scope: !121)
